WS-I/BP1.2/Messages/BaseDataTypes/XmlFormatter/DocLitW/SoapWsdl.BaseDataTypes.XmlFormatter.DocLitWrapped_RetAnyType_Client_Request-0.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IBaseDataTypesDocLitW/RetAnyType</a:Action>
    <a:MessageID>urn:uuid:ab3b8eb8-5f46-44d8-8529-ccfbfe4ed85e</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetAnyType xmlns="http://tempuri.org/">
      <inObject xmlns:d32="http://www.w3.org/2001/XMLSchema" i:type="d32:boolean" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">true</inObject>
    </RetAnyType>
  </s:Body>
</s:Envelope>